In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('tips.csv')

In [3]:
# [1] DataFrame에 대한 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [18]:
# [2] DataFrame에 대한 통계값 확인 - 숫자형 Column에 대해
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [ ]:
# [3]

In [33]:
# [4] Series에 대한 통계값 확인 - 숫자 column에 대해
df['size'].describe()

count    244.000000
mean       2.569672
std        0.951100
min        1.000000
25%        2.000000
50%        2.000000
75%        3.000000
max        6.000000
Name: size, dtype: float64

In [16]:
# [5] DataFrame에 대한 통계값 확인 - 범주형 Column에 대해
df.describe(include='O')

         sex smoker  day    time
count    244    244  244     244
unique     2      2    4       2
top     Male     No  Sat  Dinner
freq     157    151   87     176

Sum 입력 방식

DataFrame.sum(axis=0, skipna=True, level=None, numeric_only=None, min_count=0, **kwargs)

In [30]:
# [6] 특정 통계량 구하기 - mean, var, std, min, max, quantile, median
df.sum(numeric_only=True)  
#df.sum(axis=0, numeric_only=True)  Default 값은 axis=0이므로 Column에 대해 sum을 구함, axis=1으로 하면 행 별로 계산

total_bill    4827.77
tip            731.58
size           627.00
dtype: float64

In [38]:
df.min(numeric_only="True")

total_bill    3.07
tip           1.00
size          1.00
dtype: float64

In [39]:
df.max(numeric_only="True")

total_bill    50.81
tip           10.00
size           6.00
dtype: float64

In [37]:
df.median(numeric_only="True")

total_bill    17.795
tip            2.900
size           2.000
dtype: float64

In [42]:
df.quantile([0.25, 0.5, 0.75], numeric_only=True)

      total_bill     tip  size
0.25     13.3475  2.0000   2.0
0.50     17.7950  2.9000   2.0
0.75     24.1275  3.5625   3.0

### DataFrame.sort_values()
- DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key=None)
- by: 정렬 기준이 되는 column
- ascending: True-오름차순/False-내림차순

In [45]:
df.sort_values(by='tip', ascending=False)

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
212       48.33   9.00    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
..          ...    ...     ...    ...   ...     ...   ...
0         16.99   1.01  Female     No   Sun  Dinner     2
236       12.60   1.00    Male    Yes   Sat  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2

[244 rows x 7 columns]

In [48]:
# size의 오름차순, tip의 내림차순
df.sort_values(by=['size','tip'], ascending=[True,False])

     total_bill   tip     sex smoker   day    time  size
222        8.58  1.92    Male    Yes   Fri   Lunch     1
82        10.07  1.83  Female     No  Thur   Lunch     1
67         3.07  1.00  Female    Yes   Sat  Dinner     1
111        7.25  1.00  Female     No   Sat  Dinner     1
88        24.71  5.85    Male     No  Thur   Lunch     2
..          ...   ...     ...    ...   ...     ...   ...
187       30.46  2.00    Male    Yes   Sun  Dinner     5
141       34.30  6.70    Male     No  Thur   Lunch     6
143       27.05  5.00  Female     No  Thur   Lunch     6
156       48.17  5.00    Male     No   Sun  Dinner     6
125       29.80  4.20  Female     No  Thur   Lunch     6

[244 rows x 7 columns]

#### Series에서 사용하는 것들
- s.uniuqe()
- s.value_counts()
- s.str.replace() #s.dtype이 ojbect(str)이여야함

In [57]:
df3=df.copy()
df3.loc[:,'sex':'time'] = df3.loc[:,'sex':'time'].astype('str')
df3.dtypes

total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [65]:
df3

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [81]:
df3['time'].unique()

array(['Dinner', 'Lunch'], dtype=object)

In [80]:
df3['size'].unique()

array([2, 3, 4, 1, 6, 5], dtype=int64)

In [61]:
# 범주별 sample 개수
df3['time'].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [66]:
df3.sort_index(axis=1).head(2)

   day     sex  size smoker    time   tip  total_bill
0  Sun  Female     2     No  Dinner  1.01       16.99
1  Sun    Male     3     No  Dinner  1.66       10.34

In [71]:
df3.copy()['smoker'].str.replace('No', 'N').replace('Yes', 'Y')

0      N
1      N
2      N
3      N
4      N
      ..
239    N
240    Y
241    Y
242    N
243    N
Name: smoker, Length: 244, dtype: object

In [73]:
#위와 같은 함수인데 이 방식이 더 편함
#replace 안에 올 수 있는 것들이 str 외에도 list, tuple 등 여러 종류가 올 수 있음
df3.copy()['smoker'].replace(['No','Yes'],['N','Y'])

0      N
1      N
2      N
3      N
4      N
      ..
239    N
240    Y
241    Y
242    N
243    N
Name: smoker, Length: 244, dtype: object

In [74]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [78]:
# Column의 이름을 바꾸고 싶을 경우
df = df.copy().rename(columns={'tip': 'TIP', 'day':'weekday'})
df.head()

   total_bill   TIP     sex smoker weekday    time  size
0       16.99  1.01  Female     No     Sun  Dinner     2
1       10.34  1.66    Male     No     Sun  Dinner     3
2       21.01  3.50    Male     No     Sun  Dinner     3
3       23.68  3.31    Male     No     Sun  Dinner     2
4       24.59  3.61  Female     No     Sun  Dinner     4

In [79]:
df['total_bill'].round(1)

0      17.0
1      10.3
2      21.0
3      23.7
4      24.6
       ...
239    29.0
240    27.2
241    22.7
242    17.8
243    18.8
Name: total_bill, Length: 244, dtype: float64